examples/spring-2-kafka-jmeter/log-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="threadgroup_num_threads" elementType="Argument">
            <stringProp name="Argument.name">threadgroup_num_threads</stringProp>
            <stringProp name="Argument.value">${__P(threadgroup_num_threads,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="loopcontroller_loops" elementType="Argument">
            <stringProp name="Argument.name">loopcontroller_loops</stringProp>
            <stringProp name="Argument.value">${__P(loopcontroller_loops,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="httpsampler_protocol" elementType="Argument">
            <stringProp name="Argument.name">httpsampler_protocol</stringProp>
            <stringProp name="Argument.value">${__P(httpsampler_protocol,http)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="httpsampler_domain" elementType="Argument">
            <stringProp name="Argument.name">httpsampler_domain</stringProp>
            <stringProp name="Argument.value">${__P(httpsampler_domain,localhost)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="httpsampler_port" elementType="Argument">
            <stringProp name="Argument.name">httpsampler_port</stringProp>
            <stringProp name="Argument.value">${__P(httpsampler_port,8080)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="httprequest_sleepMillis" elementType="Argument">
            <stringProp name="Argument.name">httprequest_sleepMillis</stringProp>
            <stringProp name="Argument.value">${__P(httprequest_sleepMillis,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="httprequest_messageLength" elementType="Argument">
            <stringProp name="Argument.name">httprequest_messageLength</stringProp>
            <stringProp name="Argument.value">${__P(httprequest_messageLength,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="httprequest_messageCount" elementType="Argument">
            <stringProp name="Argument.name">httprequest_messageCount</stringProp>
            <stringProp name="Argument.value">${__P(httprequest_messageCount,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${loopcontroller_loops}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${threadgroup_num_threads}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${httpsampler_domain}</stringProp>
          <stringProp name="HTTPSampler.port">${httpsampler_port}</stringProp>
          <stringProp name="HTTPSampler.protocol">${httpsampler_protocol}</stringProp>
          <stringProp name="HTTPSampler.path">/test?sleepMillis=${httprequest_sleepMillis}&amp;messageLength=${httprequest_messageLength}&amp;messageCount=${httprequest_messageCount}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>